Revit 2027 API
AreaReinforcement.AdditionalBottomCoverOffset Property
 Additional offset from the bottom or interior cover reference.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AdditionalBottomCoverOffset { get; set; }
Public Property AdditionalBottomCoverOffset As Double
	Get
	Set
public:
property double AdditionalBottomCoverOffset {
	double get ();
	void set (double value);
}
member AdditionalBottomCoverOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for additionalBottomCoverOffset must be no more than 30000 feet in absolute value.
See Also
Reference
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace